levizh/hc32-f4-cmsis/Device/HDSC/hc32f334/Source/IAR/startup_hc32f334.s
                PUBWEAK UsageFault_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
UsageFault_Handler
                B       UsageFault_Handler

                PUBWEAK SVC_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SVC_Handler
                B       SVC_Handler

                PUBWEAK DebugMon_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DebugMon_Handler
                B       DebugMon_Handler

                PUBWEAK PendSV_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PendSV_Handler
                B       PendSV_Handler

                PUBWEAK SysTick_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SysTick_Handler
                B       SysTick_Handler

                PUBWEAK IRQ000_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ000_Handler
                B       IRQ000_Handler

                PUBWEAK IRQ001_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ001_Handler
                B       IRQ001_Handler

                PUBWEAK IRQ002_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ002_Handler
                B       IRQ002_Handler

                PUBWEAK IRQ003_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ003_Handler
                B       IRQ003_Handler

                PUBWEAK IRQ004_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ004_Handler
                B       IRQ004_Handler

                PUBWEAK IRQ005_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ005_Handler
                B       IRQ005_Handler

                PUBWEAK IRQ006_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ006_Handler
                B       IRQ006_Handler

                PUBWEAK IRQ007_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ007_Handler
                B       IRQ007_Handler

                PUBWEAK IRQ008_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ008_Handler
                B       IRQ008_Handler

                PUBWEAK IRQ009_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ009_Handler
                B       IRQ009_Handler

                PUBWEAK IRQ010_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ010_Handler
                B       IRQ010_Handler

                PUBWEAK IRQ011_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ011_Handler
                B       IRQ011_Handler

                PUBWEAK IRQ012_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ012_Handler
                B       IRQ012_Handler

                PUBWEAK IRQ013_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ013_Handler
                B       IRQ013_Handler

                PUBWEAK IRQ014_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ014_Handler
                B       IRQ014_Handler

                PUBWEAK IRQ015_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
IRQ015_Handler
                B       IRQ015_Handler

                PUBWEAK EXTINT00_SWINT16_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT00_SWINT16_Handler
                B       EXTINT00_SWINT16_Handler

                PUBWEAK EXTINT01_SWINT17_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT01_SWINT17_Handler
                B       EXTINT01_SWINT17_Handler

                PUBWEAK EXTINT02_SWINT18_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT02_SWINT18_Handler
                B       EXTINT02_SWINT18_Handler

                PUBWEAK EXTINT03_SWINT19_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT03_SWINT19_Handler
                B       EXTINT03_SWINT19_Handler

                PUBWEAK EXTINT04_SWINT20_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT04_SWINT20_Handler
                B       EXTINT04_SWINT20_Handler

                PUBWEAK EXTINT05_SWINT21_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT05_SWINT21_Handler
                B       EXTINT05_SWINT21_Handler

                PUBWEAK EXTINT06_SWINT22_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT06_SWINT22_Handler
                B       EXTINT06_SWINT22_Handler

                PUBWEAK EXTINT07_SWINT23_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT07_SWINT23_Handler
                B       EXTINT07_SWINT23_Handler

                PUBWEAK EXTINT08_SWINT24_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT08_SWINT24_Handler
                B       EXTINT08_SWINT24_Handler

                PUBWEAK EXTINT09_SWINT25_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT09_SWINT25_Handler
                B       EXTINT09_SWINT25_Handler

                PUBWEAK EXTINT10_SWINT26_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT10_SWINT26_Handler
                B       EXTINT10_SWINT26_Handler

                PUBWEAK EXTINT11_SWINT27_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT11_SWINT27_Handler
                B       EXTINT11_SWINT27_Handler

                PUBWEAK EXTINT12_SWINT28_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT12_SWINT28_Handler
                B       EXTINT12_SWINT28_Handler

                PUBWEAK EXTINT13_SWINT29_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT13_SWINT29_Handler
                B       EXTINT13_SWINT29_Handler

                PUBWEAK EXTINT14_SWINT30_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT14_SWINT30_Handler
                B       EXTINT14_SWINT30_Handler

                PUBWEAK EXTINT15_SWINT31_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EXTINT15_SWINT31_Handler
                B       EXTINT15_SWINT31_Handler

                PUBWEAK DMA_Error_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_Error_Handler
                B       DMA_Error_Handler

                PUBWEAK DMA_TC0_BTC0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_TC0_BTC0_Handler
                B       DMA_TC0_BTC0_Handler

                PUBWEAK DMA_TC1_BTC1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_TC1_BTC1_Handler
                B       DMA_TC1_BTC1_Handler

