levizh/hc32-f4-cmsis/Device/HDSC/hc32f334/Source/IAR/startup_hc32f334.s
                PUBWEAK DMA_TC2_BTC2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_TC2_BTC2_Handler
                B       DMA_TC2_BTC2_Handler

                PUBWEAK DMA_TC3_BTC3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_TC3_BTC3_Handler
                B       DMA_TC3_BTC3_Handler

                PUBWEAK DMA_TC4_BTC4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_TC4_BTC4_Handler
                B       DMA_TC4_BTC4_Handler

                PUBWEAK DMA_TC5_BTC5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_TC5_BTC5_Handler
                B       DMA_TC5_BTC5_Handler

                PUBWEAK DMA_TC6_BTC6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_TC6_BTC6_Handler
                B       DMA_TC6_BTC6_Handler

                PUBWEAK DMA_TC7_BTC7_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
DMA_TC7_BTC7_Handler
                B       DMA_TC7_BTC7_Handler

                PUBWEAK EFM_PEError_ReadCol_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EFM_PEError_ReadCol_Handler
                B       EFM_PEError_ReadCol_Handler

                PUBWEAK EFM_OpEnd_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EFM_OpEnd_Handler
                B       EFM_OpEnd_Handler

                PUBWEAK FPU_Error_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
FPU_Error_Handler
                B       FPU_Error_Handler

                PUBWEAK TMR0_1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR0_1_Handler
                B       TMR0_1_Handler

                PUBWEAK TMR0_2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR0_2_Handler
                B       TMR0_2_Handler

                PUBWEAK RTC_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
RTC_Handler
                B       RTC_Handler

                PUBWEAK CLK_XtalStop_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
CLK_XtalStop_Handler
                B       CLK_XtalStop_Handler

                PUBWEAK PWC_WKTM_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
PWC_WKTM_Handler
                B       PWC_WKTM_Handler

                PUBWEAK SWDT_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
SWDT_Handler
                B       SWDT_Handler

                PUBWEAK TMR6_1_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_GCmp_Handler
                B       TMR6_1_GCmp_Handler

                PUBWEAK TMR6_1_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_Ovf_Udf_Handler
                B       TMR6_1_Ovf_Udf_Handler

                PUBWEAK TMR6_1_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_Dte_Handler
                B       TMR6_1_Dte_Handler

                PUBWEAK TMR6_1_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_1_SCmp_Handler
                B       TMR6_1_SCmp_Handler

                PUBWEAK TMRA_1_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_1_Ovf_Udf_Handler
                B       TMRA_1_Ovf_Udf_Handler

                PUBWEAK TMRA_1_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_1_Cmp_Handler
                B       TMRA_1_Cmp_Handler

                PUBWEAK TMR6_2_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_GCmp_Handler
                B       TMR6_2_GCmp_Handler

                PUBWEAK TMR6_2_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_Ovf_Udf_Handler
                B       TMR6_2_Ovf_Udf_Handler

                PUBWEAK TMR6_2_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_Dte_Handler
                B       TMR6_2_Dte_Handler

                PUBWEAK TMR6_2_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_2_SCmp_Handler
                B       TMR6_2_SCmp_Handler

                PUBWEAK TMRA_2_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_2_Ovf_Udf_Handler
                B       TMRA_2_Ovf_Udf_Handler

                PUBWEAK TMRA_2_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_2_Cmp_Handler
                B       TMRA_2_Cmp_Handler

                PUBWEAK TMR6_3_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_3_GCmp_Handler
                B       TMR6_3_GCmp_Handler

                PUBWEAK TMR6_3_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_3_Ovf_Udf_Handler
                B       TMR6_3_Ovf_Udf_Handler

                PUBWEAK TMR6_3_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_3_Dte_Handler
                B       TMR6_3_Dte_Handler

                PUBWEAK TMR6_3_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_3_SCmp_Handler
                B       TMR6_3_SCmp_Handler

                PUBWEAK TMRA_3_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_3_Ovf_Udf_Handler
                B       TMRA_3_Ovf_Udf_Handler

                PUBWEAK TMRA_3_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_3_Cmp_Handler
                B       TMRA_3_Cmp_Handler

                PUBWEAK TMR6_4_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_4_GCmp_Handler
                B       TMR6_4_GCmp_Handler

                PUBWEAK TMR6_4_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_4_Ovf_Udf_Handler
                B       TMR6_4_Ovf_Udf_Handler

                PUBWEAK TMR6_4_Dte_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_4_Dte_Handler
                B       TMR6_4_Dte_Handler

                PUBWEAK TMR6_4_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR6_4_SCmp_Handler
                B       TMR6_4_SCmp_Handler

                PUBWEAK TMRA_4_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_4_Ovf_Udf_Handler
                B       TMRA_4_Ovf_Udf_Handler

                PUBWEAK TMRA_4_Cmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMRA_4_Cmp_Handler
                B       TMRA_4_Cmp_Handler

                PUBWEAK HRPWM_1_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_1_GCmp_Handler
                B       HRPWM_1_GCmp_Handler

                PUBWEAK HRPWM_1_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_1_Ovf_Udf_Handler
                B       HRPWM_1_Ovf_Udf_Handler

                PUBWEAK HRPWM_1_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_1_SCmp_Handler
                B       HRPWM_1_SCmp_Handler

