levizh/hc32-f4-cmsis/Device/HDSC/hc32f334/Source/IAR/startup_hc32f334.s
                PUBWEAK HRPWM_1_GCap_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_1_GCap_Handler
                B       HRPWM_1_GCap_Handler

                PUBWEAK HRPWM_2_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_2_GCmp_Handler
                B       HRPWM_2_GCmp_Handler

                PUBWEAK HRPWM_2_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_2_Ovf_Udf_Handler
                B       HRPWM_2_Ovf_Udf_Handler

                PUBWEAK HRPWM_2_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_2_SCmp_Handler
                B       HRPWM_2_SCmp_Handler

                PUBWEAK HRPWM_2_GCap_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_2_GCap_Handler
                B       HRPWM_2_GCap_Handler

                PUBWEAK HRPWM_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_Handler
                B       HRPWM_Handler

                PUBWEAK EMB_GR0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR0_Handler
                B       EMB_GR0_Handler

                PUBWEAK EMB_GR1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR1_Handler
                B       EMB_GR1_Handler

                PUBWEAK EMB_GR2_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR2_Handler
                B       EMB_GR2_Handler

                PUBWEAK EMB_GR3_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR3_Handler
                B       EMB_GR3_Handler

                PUBWEAK HRPWM_3_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_3_GCmp_Handler
                B       HRPWM_3_GCmp_Handler

                PUBWEAK HRPWM_3_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_3_Ovf_Udf_Handler
                B       HRPWM_3_Ovf_Udf_Handler

                PUBWEAK HRPWM_3_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_3_SCmp_Handler
                B       HRPWM_3_SCmp_Handler

                PUBWEAK HRPWM_3_GCap_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_3_GCap_Handler
                B       HRPWM_3_GCap_Handler

                PUBWEAK HRPWM_4_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_4_GCmp_Handler
                B       HRPWM_4_GCmp_Handler

                PUBWEAK HRPWM_4_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_4_Ovf_Udf_Handler
                B       HRPWM_4_Ovf_Udf_Handler

                PUBWEAK HRPWM_4_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_4_SCmp_Handler
                B       HRPWM_4_SCmp_Handler

                PUBWEAK HRPWM_4_GCap_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_4_GCap_Handler
                B       HRPWM_4_GCap_Handler

                PUBWEAK EMB_GR4_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR4_Handler
                B       EMB_GR4_Handler

                PUBWEAK EMB_GR5_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR5_Handler
                B       EMB_GR5_Handler

                PUBWEAK EMB_GR6_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR6_Handler
                B       EMB_GR6_Handler

                PUBWEAK EMB_GR7_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR7_Handler
                B       EMB_GR7_Handler

                PUBWEAK EMB_GR8_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
EMB_GR8_Handler
                B       EMB_GR8_Handler

                PUBWEAK HRPWM_5_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_5_GCmp_Handler
                B       HRPWM_5_GCmp_Handler

                PUBWEAK HRPWM_5_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_5_Ovf_Udf_Handler
                B       HRPWM_5_Ovf_Udf_Handler

                PUBWEAK HRPWM_5_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_5_SCmp_Handler
                B       HRPWM_5_SCmp_Handler

                PUBWEAK HRPWM_5_GCap_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_5_GCap_Handler
                B       HRPWM_5_GCap_Handler

                PUBWEAK HRPWM_6_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_6_GCmp_Handler
                B       HRPWM_6_GCmp_Handler

                PUBWEAK HRPWM_6_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_6_Ovf_Udf_Handler
                B       HRPWM_6_Ovf_Udf_Handler

                PUBWEAK HRPWM_6_SCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_6_SCmp_Handler
                B       HRPWM_6_SCmp_Handler

                PUBWEAK HRPWM_6_GCap_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
HRPWM_6_GCap_Handler
                B       HRPWM_6_GCap_Handler

                PUBWEAK MCANRAM_ECCError_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCANRAM_ECCError_Handler
                B       MCANRAM_ECCError_Handler

                PUBWEAK MCAN1_INT0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN1_INT0_Handler
                B       MCAN1_INT0_Handler

                PUBWEAK MCAN1_INT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN1_INT1_Handler
                B       MCAN1_INT1_Handler

                PUBWEAK MCAN2_INT0_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN2_INT0_Handler
                B       MCAN2_INT0_Handler

                PUBWEAK MCAN2_INT1_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
MCAN2_INT1_Handler
                B       MCAN2_INT1_Handler

                PUBWEAK TMR4_GCmp_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_GCmp_Handler
                B       TMR4_GCmp_Handler

                PUBWEAK TMR4_Ovf_Udf_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_Ovf_Udf_Handler
                B       TMR4_Ovf_Udf_Handler

                PUBWEAK TMR4_Reload_Handler
                SECTION .text:CODE:NOROOT:REORDER(1)
TMR4_Reload_Handler
                B       TMR4_Reload_Handler

